{"green fingers": "Fingers that are colored green, either due to paint, dye, or other substances.", "ancient history": "The study or record of events, people, and societies from the distant past, typically before the Middle Ages.", "devil's advocate": "A person who argues against a cause or position, not out of genuine opposition, but to test the validity of the argument or to provoke deeper discussion.", "piece of cake": "A portion or slice of a baked dessert made from flour, sugar, eggs, and other ingredients.", "brass ring": "A ring made of brass, often used as a decorative or functional item.", "apples and oranges": "Two different types of fruits, specifically apples and oranges.", "ghost town": "A deserted town with no remaining inhabitants, often in a state of decay.", "flower child": "A young child who is associated with or resembles a flower, often in appearance or innocence.", "copy cat": "A cat that imitates or copies the actions of another cat or animal.", "secret santa": "A person named Santa who is secretive or keeps their identity hidden.", "dirty word": "A word that is considered vulgar, offensive, or inappropriate in language.", "close shave": "A shave performed with a razor that cuts hair very close to the skin, leaving a smooth finish.", "donkey work": "The physical labor or tasks performed by a donkey, such as carrying loads or pulling carts.", "top dog": "The highest-ranking or most dominant dog in a group.", "dog's dinner": "A meal prepared for a dog, typically consisting of dog food or scraps.", "zebra crossing": "A pedestrian crossing marked with white stripes resembling a zebra's pattern, used to indicate where pedestrians can safely cross the road.", "eye candy": "Candy shaped like or resembling an eye, often used as a decorative or novelty item.", "armchair critic": "A person who sits in an armchair and criticizes others.", "hot potato": "A potato that is hot in temperature, typically after being cooked.", "love triangle": "A geometric shape with three sides, where each side represents a romantic relationship between three people.", "black box": "A physical box that is black in color, often used to contain or protect something.", "hen party": "A gathering or party exclusively for hens (female chickens).", "acid test": "A test using acid to determine the purity or quality of a substance, such as gold.", "pins and needles": "Sharp, pointed objects used for sewing and small, thin metal tools used for fastening or piercing.", "bun in the oven": "A bread roll placed inside an oven for baking.", "loan shark": "A predatory fish that lends money to other sea creatures at exorbitant interest rates.", "silver bullet": "A bullet made of silver, often associated with folklore as a weapon against supernatural creatures like werewolves.", "two-way street": "A street or road that allows traffic to move in both directions.", "cold turkey": "A dish made from cooked turkey that has been served cold, often as leftovers or in sandwiches.", "wet blanket": "A blanket that is wet or damp.", "chicken feed": "Food given to chickens, typically consisting of grains or seeds."}