[
    "It took a lot of elbow grease to get the old engine running again.",
    "It's a constant battle for us, as he is a morning person and I am a night owl, so I find that going to sleep at 9.30 really cuts out the best hours.",
    "Even the somewhat seedy failed private eye has a heart of gold (and a bad hairstyle).",
    "ESA's Space Weather Office is like Europe's stellar agony aunt, offering forecasts, advice and information for any organisation, individual or institution vulnerable to space phenomena.",
    "This aged, rich wine is no shrinking violet with its with peppery, meaty focus and its broad yet tannic palatal impressions.",
    "They are a boogeyman he scares you with while he colludes with your enemies, turns your country into a banana republic and uses the office to enrich himself.",
    "If you want dirt, the private eye suggested, you should steal the man's garbage.",
    "The result is that whether you sleep on your back or your side, the ultimate night's sleep is no longer a pipe dream.",
    "This isn't rocket science: he talks about basic business skills like negotiation, time management and creativity.",
    "Some would be better off with no insurance and using the money saved to build a nest egg to see them through lean times or pay off their debt.",
    "The three year bull market in equities has certainly boosted the fortunes of these companies by increasing the value of their assets.",
    "One scene is the Strip, which he described as a beached whale, and the neighborhood dining scene, which is making successful efforts to adapt.",
    "Barry was the first, an archetypal lounge lizard in his shiny suit and overpowering aftershave; I met him in my local nightclub.",
    "Our exposure to technology, sector bets, and decision to increase equity exposure during the depth of the bear market helped position the fund to outperform.",
    "We only use white hat, ethical search engine optimization techniques that will lead to long term success and unlike many SEO firms we will never use any tactics that have a risk of harming your site.",
    "This really is the smoking gun of a watery past for Mars, says David Grinspoon, principal scientist at the Southwest Research Institute in Boulder.",
    "She ran into an old flame at the high school reunion.",
    "Recently the globalization adversaries emerged; the experts at the universities had to abandon their ivory towers and present their research at the market place in order to rebuild public confidence.",
    "While DS9 was looked at as the black sheep of the Star Trek franchise for many years, it has found a renewed and dedicated fanbase thanks to Netflix.",
    "It represented them having signed away their birthright so that they can join their fellow politicians on the gravy train.",
    "Get the heck out of the rat race, move to rural America, plant a huge garden, raise chickens, and keep a year's worth of food in the root cellar.",
    "Paice is no spring chicken and what he lacked in raw speed he made up with flair and aesthetic.",
    "Formal or informal contacts with the prime minister or his inner circle are now greatly prized by the persuaders.",
    "The problem for them, of course, is how to explain how these few bad apples managed to stay in place for so many years.",
    "Thousands of people are turning to the internet for more information - leading them straight into the honey trap set up by cybercriminals.",
    "Our conversation was wide-ranging and candid as, unlike other CEOs, Rénier was an open book and willing to speak about anything that came her way.",
    "However, the symptoms of baby blues are mild and usually disappear after a couple of weeks.",
    "The know-how necessary to keep physicians financially healthy might not be brain surgery, but it can be cumbersome and complicated.",
    "The biggest red flag of all, though, was that neither newspaper ever linked to the supposed study of violence in teenagers.",
    "Miami's original Metrorail line was a white elephant when it was built and it remains one today.",
    "Residents were concerned about speeding vehicles, including the delivery lorries and the road being used as a rat run.",
    "He moved from the 10 pm slot to his lower profile life as a DJ on Radio Norwich's graveyard shift.",
    "When dirty money disappears offshore, it becomes more difficult for governments to tackle corruption.",
    "It just showed how she still lived the high life while everyone else endured rationing.",
    "It usually causes high temperature and pain in the neck, jaw or ear.",
    "A former resident of one of the homes said she was used as a guinea pig for vaccines at a home in Cork, before being adopted in 1961.",
    "American roads in the South do have cat's eyes but we don't have them in regions with snow because the plows would scrape them up every winter.",
    "Howard said there was a lot of low-hanging fruit to be found in customers who have large back-office teams ready for automation.",
    "There's no need to worry if you're a busy bee - even just 10 minutes of meditation can bring many benefits."
]