[
    "The toddler ran in and proudly held up a picture of a tree as her green fingers threatened to smear paint on the kitchen walls and cupboards.",
    "This course will suit anyone fascinated by Greece and Rome, who recognises the continuing influence of ancient history on the modern world.",
    "The manga follows Hinata, who gives up his job as the Devil's advocate and abandons the afterlife to pursue his dream of opening an American diner.",
    "He picked up the piece of cake and took a large bite, chewing noisily.",
    "A composite gaming chip which includes a strong frame made of a brass ring with axial protrusions and a central aperature with notches.",
    "Another one of us asked parents to cut up different types of apples and oranges, taste them, talk about their differences and go through a range of other experiences.",
    "Our wanderings had led us perilously close to the walls of the ghost town where restless spirits haunted the streets, eager to absorb the vitatlity of the living.",
    "Players take on the role of a young flower child, with customisation options to alter the appearance of their petals and leaves.",
    "The playful kitten, a miniature copy cat, mimicked the yoga poses of its human owner, its tiny paws mirroring the intricate movements.",
    "St Nicholas becomes a secret santa in this fun adventure, going undercover to keep an eye on the elves in his workshop.",
    "They traced the letters onto the window in mud with their fingers, forming a dirty word which they hoped would lead the others to their location.",
    "This kind of close shave is optimal for many men, but for others can contribute to skin irritation or a propensity for ingrown hairs.",
    "We have the donkey work from the stable if it is raining because it is the only shelter we have.",
    "The top dog in the neighborhood seemed to be guarding the alley from passing cats all day.",
    "Whether your kitty is tempted to sneak a bite of your dog's dinner or you've run out of cat food, you may be wondering if cats can eat dog food.",
    "Our driver had to brake hard when we encountered a zebra crossing the road, looking for fresh grazing.",
    "There was plenty of delicious eye candy on offer at the Halloween party, and the group enjoyed eating the various themed snacks on display.",
    "The magazine, aimed at trendy homeowners, publishes furniture reviews by its resident armchair critic alongside coffee prearation tips.",
    "The kransky wasn't amazing, and the poached eggs were good, but the apple compote as well as the hot potato and cauliflower slaw were great.",
    "At the craft fair, the artist sold pendants shaped like a love triangle, with each side adorned with intricate heart patterns.",
    "The unit is encased in an attractive anodized black box that provides EMI/RFI shielding and allows for secure mounting with its threaded inserts on the bottom of its chassis.",
    "In the barnyard, the hens gathered for their early morning hen party, pecking at the scattered feed and clucking excitedly.",
    "There are qualitative chemical physiologies, for example, the acid test for gold and the Kastle-Meyer test for the presence of blood.",
    "I did a sweep for stray pins and needles and packaged up the tissue paper pattern pieces, folding along my muslin adjustments with them.",
    "Popping a stale bun in the oven for a few minutes will let you make tasty lunches for an extra day or two.",
    "Our mermaid heroine visits a loan shark which offers her the shells she needs in exchange for repayment and a favor once she becomes queen.",
    "Chastel had loaded a custom made silver bullet into his gun with which he fired on the creature and killed the beast with a single shot.",
    "In many cases, two-way streets result in twice as many pedestrian accidents as one way.",
    "When you're serving cold turkey, take out only as much as you're going to use and put the rest back in the fridge.",
    "Wet blankets draped over neighboring cabins prevented the fire from spreading.",
    "Feed pets inside and do not leave pet, livestock or chicken feed outside."
]