{"green fingers": "Fingers that are colored green, either due to paint, dye, or other substances.", "ancient history": "The study or record of events, people, and societies from the distant past, typically before the Middle Ages.", "devil's advocate": "A person who argues against a cause or position, not out of personal belief, but to test the validity of the argument or to provoke deeper discussion.", "piece of cake": "A portion or slice of a baked dessert made from flour, sugar, eggs, and other ingredients.", "brass ring": "A ring made of brass, a metal alloy consisting primarily of copper and zinc.", "apples and oranges": "Two different types of fruits, specifically apples and oranges.", "ghost town": "A deserted or abandoned town with few or no remaining inhabitants, often due to economic decline or natural disasters.", "copy cat": "A cat that imitates or copies the actions of another cat or animal.", "secret santa": "A person named Santa who is secretive or keeps their identity hidden.", "dirty word": "A word that is considered vulgar, offensive, or inappropriate in language.", "close shave": "A shave performed very closely to the skin, leaving little or no hair.", "donkey work": "The physical labor or tasks performed by a donkey, such as carrying loads or pulling carts.", "top dog": "The highest-ranking or most dominant dog in a group or pack.", "zebra crossing": "A pedestrian crossing marked with black and white stripes, resembling a zebra's pattern, where pedestrians have the right of way.", "eye candy": "Candy shaped or designed to resemble an eye, often used for decorative or novelty purposes.", "armchair critic": "A critic who sits in an armchair while giving opinions or judgments.", "hot potato": "A potato that is hot in temperature.", "love triangle": "A geometric shape with three sides, where each side represents a romantic relationship involving three people.", "black box": "A physical box that is black in color, often used to contain or protect something.", "hen party": "A social gathering or party attended exclusively by women, typically held for a bride-to-be before her wedding.", "pins and needles": "Small, sharp objects used in sewing (pins) and thin, pointed tools used for knitting or medical purposes (needles).", "bun in the oven": "A bread roll placed inside an oven for baking.", "loan shark": "A predatory lender who offers loans at extremely high interest rates, often using unethical or illegal methods to collect payments.", "two-way street": "A street or road that allows traffic to move in both directions.", "wet blanket": "A blanket that is damp or soaked with water.", "chicken feed": "Food given to chickens, typically consisting of grains or seeds."}